Revit 2027 API
ExportDGNSettings.GetDGNExportOptions Method
 Gets the options stored in the these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DGNExportOptions GetDGNExportOptions()
Public Function GetDGNExportOptions As DGNExportOptions
public:
DGNExportOptions^ GetDGNExportOptions()
member GetDGNExportOptions : unit -> DGNExportOptions
Return Value
DGNExportOptions
 The options.
See Also
Reference
ExportDGNSettings Class
Autodesk.Revit.DB Namespace